FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_port.h
/**
 * \file
 *
 * \brief Component description for PORT
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_PORT_COMPONENT_
#define _SAMD20_PORT_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PORT */
/* ========================================================================== */
/** \addtogroup SAMD20_PORT Port Module */
/*@{*/

#define REV_PORT    0x100

/* -------- PORT_DIR : (PORT Offset: 0x00) (R/W 32) GROUP Data Direction Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t DIR : 32; /*!< bit:  0..31  Port Data Direction                */
        } bit;                 /*!< Structure used for bit  access                  */
        uint32_t reg;          /*!< Type      used for register access              */
    } PORT_DIR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_DIR_OFFSET        0x00              /**< \brief (PORT_DIR offset) Data Direction Register */
#define PORT_DIR_RESETVALUE    0x00000000        /**< \brief (PORT_DIR reset_value) Data Direction Register */

#define PORT_DIR_DIR_Pos       0                 /**< \brief (PORT_DIR) Port Data Direction */
#define PORT_DIR_DIR_Msk       ( 0xFFFFFFFFu << PORT_DIR_DIR_Pos )
#define PORT_DIR_DIR( value )    ( ( PORT_DIR_DIR_Msk & ( ( value ) << PORT_DIR_DIR_Pos ) ) )
#define PORT_DIR_MASK          0xFFFFFFFFu       /**< \brief (PORT_DIR) MASK Register */

/* -------- PORT_DIRCLR : (PORT Offset: 0x04) (R/W 32) GROUP Data Direction Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t DIRCLR : 32; /*!< bit:  0..31  Port Data Direction Clear          */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } PORT_DIRCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_DIRCLR_OFFSET        0x04           /**< \brief (PORT_DIRCLR offset) Data Direction Clear Register */
#define PORT_DIRCLR_RESETVALUE    0x00000000     /**< \brief (PORT_DIRCLR reset_value) Data Direction Clear Register */

#define PORT_DIRCLR_DIRCLR_Pos    0              /**< \brief (PORT_DIRCLR) Port Data Direction Clear */
#define PORT_DIRCLR_DIRCLR_Msk    ( 0xFFFFFFFFu << PORT_DIRCLR_DIRCLR_Pos )
#define PORT_DIRCLR_DIRCLR( value )    ( ( PORT_DIRCLR_DIRCLR_Msk & ( ( value ) << PORT_DIRCLR_DIRCLR_Pos ) ) )
#define PORT_DIRCLR_MASK          0xFFFFFFFFu    /**< \brief (PORT_DIRCLR) MASK Register */

/* -------- PORT_DIRSET : (PORT Offset: 0x08) (R/W 32) GROUP Data Direction Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t DIRSET : 32; /*!< bit:  0..31  Port Data Direction Set            */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } PORT_DIRSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_DIRSET_OFFSET        0x08           /**< \brief (PORT_DIRSET offset) Data Direction Set Register */
#define PORT_DIRSET_RESETVALUE    0x00000000     /**< \brief (PORT_DIRSET reset_value) Data Direction Set Register */

#define PORT_DIRSET_DIRSET_Pos    0              /**< \brief (PORT_DIRSET) Port Data Direction Set */
#define PORT_DIRSET_DIRSET_Msk    ( 0xFFFFFFFFu << PORT_DIRSET_DIRSET_Pos )
#define PORT_DIRSET_DIRSET( value )    ( ( PORT_DIRSET_DIRSET_Msk & ( ( value ) << PORT_DIRSET_DIRSET_Pos ) ) )
#define PORT_DIRSET_MASK          0xFFFFFFFFu    /**< \brief (PORT_DIRSET) MASK Register */

/* -------- PORT_DIRTGL : (PORT Offset: 0x0C) (R/W 32) GROUP Data Direction Toggle Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t DIRTGL : 32; /*!< bit:  0..31  Port Data Direction Toggle         */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } PORT_DIRTGL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_DIRTGL_OFFSET        0x0C           /**< \brief (PORT_DIRTGL offset) Data Direction Toggle Register */
#define PORT_DIRTGL_RESETVALUE    0x00000000     /**< \brief (PORT_DIRTGL reset_value) Data Direction Toggle Register */

#define PORT_DIRTGL_DIRTGL_Pos    0              /**< \brief (PORT_DIRTGL) Port Data Direction Toggle */
#define PORT_DIRTGL_DIRTGL_Msk    ( 0xFFFFFFFFu << PORT_DIRTGL_DIRTGL_Pos )
#define PORT_DIRTGL_DIRTGL( value )    ( ( PORT_DIRTGL_DIRTGL_Msk & ( ( value ) << PORT_DIRTGL_DIRTGL_Pos ) ) )
#define PORT_DIRTGL_MASK          0xFFFFFFFFu    /**< \brief (PORT_DIRTGL) MASK Register */

/* -------- PORT_OUT : (PORT Offset: 0x10) (R/W 32) GROUP Data Output Value Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t OUT : 32; /*!< bit:  0..31  Port Data Output Value             */
        } bit;                 /*!< Structure used for bit  access                  */
        uint32_t reg;          /*!< Type      used for register access              */
    } PORT_OUT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_OUT_OFFSET        0x10              /**< \brief (PORT_OUT offset) Data Output Value Register */
#define PORT_OUT_RESETVALUE    0x00000000        /**< \brief (PORT_OUT reset_value) Data Output Value Register */

#define PORT_OUT_OUT_Pos       0                 /**< \brief (PORT_OUT) Port Data Output Value */
#define PORT_OUT_OUT_Msk       ( 0xFFFFFFFFu << PORT_OUT_OUT_Pos )
#define PORT_OUT_OUT( value )    ( ( PORT_OUT_OUT_Msk & ( ( value ) << PORT_OUT_OUT_Pos ) ) )
#define PORT_OUT_MASK          0xFFFFFFFFu       /**< \brief (PORT_OUT) MASK Register */

