FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_port.h
/* -------- PORT_OUTCLR : (PORT Offset: 0x14) (R/W 32) GROUP Data Output Value Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t OUTCLR : 32; /*!< bit:  0..31  Port Data Output Value Clear       */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } PORT_OUTCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_OUTCLR_OFFSET        0x14           /**< \brief (PORT_OUTCLR offset) Data Output Value Clear Register */
#define PORT_OUTCLR_RESETVALUE    0x00000000     /**< \brief (PORT_OUTCLR reset_value) Data Output Value Clear Register */

#define PORT_OUTCLR_OUTCLR_Pos    0              /**< \brief (PORT_OUTCLR) Port Data Output Value Clear */
#define PORT_OUTCLR_OUTCLR_Msk    ( 0xFFFFFFFFu << PORT_OUTCLR_OUTCLR_Pos )
#define PORT_OUTCLR_OUTCLR( value )    ( ( PORT_OUTCLR_OUTCLR_Msk & ( ( value ) << PORT_OUTCLR_OUTCLR_Pos ) ) )
#define PORT_OUTCLR_MASK          0xFFFFFFFFu    /**< \brief (PORT_OUTCLR) MASK Register */

/* -------- PORT_OUTSET : (PORT Offset: 0x18) (R/W 32) GROUP Data Output Value Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t OUTSET : 32; /*!< bit:  0..31  Port Data Output Value Set         */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } PORT_OUTSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_OUTSET_OFFSET        0x18           /**< \brief (PORT_OUTSET offset) Data Output Value Set Register */
#define PORT_OUTSET_RESETVALUE    0x00000000     /**< \brief (PORT_OUTSET reset_value) Data Output Value Set Register */

#define PORT_OUTSET_OUTSET_Pos    0              /**< \brief (PORT_OUTSET) Port Data Output Value Set */
#define PORT_OUTSET_OUTSET_Msk    ( 0xFFFFFFFFu << PORT_OUTSET_OUTSET_Pos )
#define PORT_OUTSET_OUTSET( value )    ( ( PORT_OUTSET_OUTSET_Msk & ( ( value ) << PORT_OUTSET_OUTSET_Pos ) ) )
#define PORT_OUTSET_MASK          0xFFFFFFFFu    /**< \brief (PORT_OUTSET) MASK Register */

/* -------- PORT_OUTTGL : (PORT Offset: 0x1C) (R/W 32) GROUP Data Output Value Toggle Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t OUTTGL : 32; /*!< bit:  0..31  Port Data Output Value Toggle      */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } PORT_OUTTGL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_OUTTGL_OFFSET        0x1C           /**< \brief (PORT_OUTTGL offset) Data Output Value Toggle Register */
#define PORT_OUTTGL_RESETVALUE    0x00000000     /**< \brief (PORT_OUTTGL reset_value) Data Output Value Toggle Register */

#define PORT_OUTTGL_OUTTGL_Pos    0              /**< \brief (PORT_OUTTGL) Port Data Output Value Toggle */
#define PORT_OUTTGL_OUTTGL_Msk    ( 0xFFFFFFFFu << PORT_OUTTGL_OUTTGL_Pos )
#define PORT_OUTTGL_OUTTGL( value )    ( ( PORT_OUTTGL_OUTTGL_Msk & ( ( value ) << PORT_OUTTGL_OUTTGL_Pos ) ) )
#define PORT_OUTTGL_MASK          0xFFFFFFFFu    /**< \brief (PORT_OUTTGL) MASK Register */

/* -------- PORT_IN : (PORT Offset: 0x20) (R/  32) GROUP Data Input Value Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t IN : 32;  /*!< bit:  0..31  Port Data Input Value              */
        } bit;                 /*!< Structure used for bit  access                  */
        uint32_t reg;          /*!< Type      used for register access              */
    } PORT_IN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_IN_OFFSET        0x20               /**< \brief (PORT_IN offset) Data Input Value Register */
#define PORT_IN_RESETVALUE    0x00000000         /**< \brief (PORT_IN reset_value) Data Input Value Register */

#define PORT_IN_IN_Pos        0                  /**< \brief (PORT_IN) Port Data Input Value */
#define PORT_IN_IN_Msk        ( 0xFFFFFFFFu << PORT_IN_IN_Pos )
#define PORT_IN_IN( value )    ( ( PORT_IN_IN_Msk & ( ( value ) << PORT_IN_IN_Pos ) ) )
#define PORT_IN_MASK          0xFFFFFFFFu        /**< \brief (PORT_IN) MASK Register */

/* -------- PORT_CTRL : (PORT Offset: 0x24) (R/W 32) GROUP Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t SAMPLING : 32; /*!< bit:  0..31  Input Sampling Mode                */
        } bit;                      /*!< Structure used for bit  access                  */
        uint32_t reg;               /*!< Type      used for register access              */
    } PORT_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_CTRL_OFFSET          0x24           /**< \brief (PORT_CTRL offset) Control Register */
#define PORT_CTRL_RESETVALUE      0x00000000     /**< \brief (PORT_CTRL reset_value) Control Register */

#define PORT_CTRL_SAMPLING_Pos    0              /**< \brief (PORT_CTRL) Input Sampling Mode */
#define PORT_CTRL_SAMPLING_Msk    ( 0xFFFFFFFFu << PORT_CTRL_SAMPLING_Pos )
#define PORT_CTRL_SAMPLING( value )    ( ( PORT_CTRL_SAMPLING_Msk & ( ( value ) << PORT_CTRL_SAMPLING_Pos ) ) )
#define PORT_CTRL_MASK            0xFFFFFFFFu    /**< \brief (PORT_CTRL) MASK Register */

/* -------- PORT_WRCONFIG : (PORT Offset: 0x28) ( /W 32) GROUP Write Configuration Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PINMASK : 16; /*!< bit:  0..15  Pin Mask for Multiple Pin Configuration */
            uint32_t PMUXEN : 1;   /*!< bit:     16  Select Peripheral Multiplexer      */
            uint32_t INEN : 1;     /*!< bit:     17  Input Enable                       */
            uint32_t PULLEN : 1;   /*!< bit:     18  Pull Enable                        */
            uint32_t ODRAIN : 1;   /*!< bit:     19  Open Drain Output                  */
            uint32_t SLEWLIM : 1;  /*!< bit:     20  Output Driver Slew Rate Limit Enable */
            uint32_t : 1;          /*!< bit:     21  Reserved                           */
            uint32_t DRVSTR : 1;   /*!< bit:     22  Output Driver Strength Selection   */
            uint32_t : 1;          /*!< bit:     23  Reserved                           */
            uint32_t PMUX : 4;     /*!< bit: 24..27  Peripheral Multiplexing Template   */
            uint32_t WRPMUX : 1;   /*!< bit:     28  Write PMUX Registers               */
            uint32_t : 1;          /*!< bit:     29  Reserved                           */
            uint32_t WRPINCFG : 1; /*!< bit:     30  Write PINCFG Registers             */
            uint32_t HWSEL : 1;    /*!< bit:     31  Half-Word Select                   */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } PORT_WRCONFIG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

