FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_port.h
#define PORT_WRCONFIG_OFFSET          0x28       /**< \brief (PORT_WRCONFIG offset) Write Configuration Register */
#define PORT_WRCONFIG_RESETVALUE      0x00000000 /**< \brief (PORT_WRCONFIG reset_value) Write Configuration Register */

#define PORT_WRCONFIG_PINMASK_Pos     0          /**< \brief (PORT_WRCONFIG) Pin Mask for Multiple Pin Configuration */
#define PORT_WRCONFIG_PINMASK_Msk     ( 0xFFFFu << PORT_WRCONFIG_PINMASK_Pos )
#define PORT_WRCONFIG_PINMASK( value )    ( ( PORT_WRCONFIG_PINMASK_Msk & ( ( value ) << PORT_WRCONFIG_PINMASK_Pos ) ) )
#define PORT_WRCONFIG_PMUXEN_Pos      16         /**< \brief (PORT_WRCONFIG) Select Peripheral Multiplexer */
#define PORT_WRCONFIG_PMUXEN          ( 0x1u << PORT_WRCONFIG_PMUXEN_Pos )
#define PORT_WRCONFIG_INEN_Pos        17         /**< \brief (PORT_WRCONFIG) Input Enable */
#define PORT_WRCONFIG_INEN            ( 0x1u << PORT_WRCONFIG_INEN_Pos )
#define PORT_WRCONFIG_PULLEN_Pos      18         /**< \brief (PORT_WRCONFIG) Pull Enable */
#define PORT_WRCONFIG_PULLEN          ( 0x1u << PORT_WRCONFIG_PULLEN_Pos )
#define PORT_WRCONFIG_ODRAIN_Pos      19         /**< \brief (PORT_WRCONFIG) Open Drain Output */
#define PORT_WRCONFIG_ODRAIN          ( 0x1u << PORT_WRCONFIG_ODRAIN_Pos )
#define PORT_WRCONFIG_SLEWLIM_Pos     20         /**< \brief (PORT_WRCONFIG) Output Driver Slew Rate Limit Enable */
#define PORT_WRCONFIG_SLEWLIM         ( 0x1u << PORT_WRCONFIG_SLEWLIM_Pos )
#define PORT_WRCONFIG_DRVSTR_Pos      22         /**< \brief (PORT_WRCONFIG) Output Driver Strength Selection */
#define PORT_WRCONFIG_DRVSTR          ( 0x1u << PORT_WRCONFIG_DRVSTR_Pos )
#define PORT_WRCONFIG_PMUX_Pos        24         /**< \brief (PORT_WRCONFIG) Peripheral Multiplexing Template */
#define PORT_WRCONFIG_PMUX_Msk        ( 0xFu << PORT_WRCONFIG_PMUX_Pos )
#define PORT_WRCONFIG_PMUX( value )    ( ( PORT_WRCONFIG_PMUX_Msk & ( ( value ) << PORT_WRCONFIG_PMUX_Pos ) ) )
#define PORT_WRCONFIG_WRPMUX_Pos      28          /**< \brief (PORT_WRCONFIG) Write PMUX Registers */
#define PORT_WRCONFIG_WRPMUX          ( 0x1u << PORT_WRCONFIG_WRPMUX_Pos )
#define PORT_WRCONFIG_WRPINCFG_Pos    30          /**< \brief (PORT_WRCONFIG) Write PINCFG Registers */
#define PORT_WRCONFIG_WRPINCFG        ( 0x1u << PORT_WRCONFIG_WRPINCFG_Pos )
#define PORT_WRCONFIG_HWSEL_Pos       31          /**< \brief (PORT_WRCONFIG) Half-Word Select */
#define PORT_WRCONFIG_HWSEL           ( 0x1u << PORT_WRCONFIG_HWSEL_Pos )
#define PORT_WRCONFIG_MASK            0xDF5FFFFFu /**< \brief (PORT_WRCONFIG) MASK Register */

/* -------- PORT_PMUX : (PORT Offset: 0x30) (R/W  8) GROUP Peripheral Multiplexing Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t PMUXE : 4; /*!< bit:  0.. 3  Peripheral Multiplexing for Even-Numbered Pin */
            uint8_t PMUXO : 4; /*!< bit:  4.. 7  Peripheral Multiplexing for Odd-Numbered Pin */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } PORT_PMUX_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_PMUX_OFFSET        0x30             /**< \brief (PORT_PMUX offset) Peripheral Multiplexing Register */
#define PORT_PMUX_RESETVALUE    0x00             /**< \brief (PORT_PMUX reset_value) Peripheral Multiplexing Register */

#define PORT_PMUX_PMUXE_Pos     0                /**< \brief (PORT_PMUX) Peripheral Multiplexing for Even-Numbered Pin */
#define PORT_PMUX_PMUXE_Msk     ( 0xFu << PORT_PMUX_PMUXE_Pos )
#define PORT_PMUX_PMUXE( value )    ( ( PORT_PMUX_PMUXE_Msk & ( ( value ) << PORT_PMUX_PMUXE_Pos ) ) )
#define PORT_PMUX_PMUXO_Pos     4                /**< \brief (PORT_PMUX) Peripheral Multiplexing for Odd-Numbered Pin */
#define PORT_PMUX_PMUXO_Msk     ( 0xFu << PORT_PMUX_PMUXO_Pos )
#define PORT_PMUX_PMUXO( value )    ( ( PORT_PMUX_PMUXO_Msk & ( ( value ) << PORT_PMUX_PMUXO_Pos ) ) )
#define PORT_PMUX_MASK          0xFFu            /**< \brief (PORT_PMUX) MASK Register */

/* -------- PORT_PINCFG : (PORT Offset: 0x40) (R/W  8) GROUP Pin Configuration Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t PMUXEN : 1;  /*!< bit:      0  Select Peripheral Multiplexer      */
            uint8_t INEN : 1;    /*!< bit:      1  Input Enable                       */
            uint8_t PULLEN : 1;  /*!< bit:      2  Pull Enable                        */
            uint8_t ODRAIN : 1;  /*!< bit:      3  Open Drain Output                  */
            uint8_t SLEWLIM : 1; /*!< bit:      4  Output Driver Slew Rate Limit Enable */
            uint8_t  : 1;        /*!< bit:      5  Reserved                           */
            uint8_t DRVSTR : 1;  /*!< bit:      6  Output Driver Strength Selection   */
            uint8_t  : 1;        /*!< bit:      7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } PORT_PINCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PORT_PINCFG_OFFSET         0x40          /**< \brief (PORT_PINCFG offset) Pin Configuration Register */
#define PORT_PINCFG_RESETVALUE     0x00          /**< \brief (PORT_PINCFG reset_value) Pin Configuration Register */

#define PORT_PINCFG_PMUXEN_Pos     0             /**< \brief (PORT_PINCFG) Select Peripheral Multiplexer */
#define PORT_PINCFG_PMUXEN         ( 0x1u << PORT_PINCFG_PMUXEN_Pos )
#define PORT_PINCFG_INEN_Pos       1             /**< \brief (PORT_PINCFG) Input Enable */
#define PORT_PINCFG_INEN           ( 0x1u << PORT_PINCFG_INEN_Pos )
#define PORT_PINCFG_PULLEN_Pos     2             /**< \brief (PORT_PINCFG) Pull Enable */
#define PORT_PINCFG_PULLEN         ( 0x1u << PORT_PINCFG_PULLEN_Pos )
#define PORT_PINCFG_ODRAIN_Pos     3             /**< \brief (PORT_PINCFG) Open Drain Output */
#define PORT_PINCFG_ODRAIN         ( 0x1u << PORT_PINCFG_ODRAIN_Pos )
#define PORT_PINCFG_SLEWLIM_Pos    4             /**< \brief (PORT_PINCFG) Output Driver Slew Rate Limit Enable */
#define PORT_PINCFG_SLEWLIM        ( 0x1u << PORT_PINCFG_SLEWLIM_Pos )
#define PORT_PINCFG_DRVSTR_Pos     6             /**< \brief (PORT_PINCFG) Output Driver Strength Selection */
#define PORT_PINCFG_DRVSTR         ( 0x1u << PORT_PINCFG_DRVSTR_Pos )
#define PORT_PINCFG_MASK           0x5Fu         /**< \brief (PORT_PINCFG) MASK Register */

