FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_port.h
/** \brief PortGroup hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct
    {
        __IO PORT_DIR_Type DIR;               /**< \brief Offset: 0x00 (R/W 32) Data Direction Register */
        __IO PORT_DIRCLR_Type DIRCLR;         /**< \brief Offset: 0x04 (R/W 32) Data Direction Clear Register */
        __IO PORT_DIRSET_Type DIRSET;         /**< \brief Offset: 0x08 (R/W 32) Data Direction Set Register */
        __IO PORT_DIRTGL_Type DIRTGL;         /**< \brief Offset: 0x0C (R/W 32) Data Direction Toggle Register */
        __IO PORT_OUT_Type OUT;               /**< \brief Offset: 0x10 (R/W 32) Data Output Value Register */
        __IO PORT_OUTCLR_Type OUTCLR;         /**< \brief Offset: 0x14 (R/W 32) Data Output Value Clear Register */
        __IO PORT_OUTSET_Type OUTSET;         /**< \brief Offset: 0x18 (R/W 32) Data Output Value Set Register */
        __IO PORT_OUTTGL_Type OUTTGL;         /**< \brief Offset: 0x1C (R/W 32) Data Output Value Toggle Register */
        __I PORT_IN_Type IN;                  /**< \brief Offset: 0x20 (R/  32) Data Input Value Register */
        __IO PORT_CTRL_Type CTRL;             /**< \brief Offset: 0x24 (R/W 32) Control Register */
        __O PORT_WRCONFIG_Type WRCONFIG;      /**< \brief Offset: 0x28 ( /W 32) Write Configuration Register */
        RoReg8 Reserved1[ 0x4 ];
        __IO PORT_PMUX_Type PMUX[ 16 ];       /**< \brief Offset: 0x30 (R/W  8) Peripheral Multiplexing Register */
        __IO PORT_PINCFG_Type PINCFG[ 32 ];   /**< \brief Offset: 0x40 (R/W  8) Pin Configuration Register */
        RoReg8 Reserved2[ 0x20 ];
    } PortGroup;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief PORT hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct
    {
        PortGroup Group[ 2 ];                 /**< \brief Offset: 0x00 PortGroup groups [GROUPS] */
    } Port;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_PORT_COMPONENT_ */
